{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          },
          "inbound_nodes": []
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [[["input_1", 0, 0, {}]]]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32"
          },
          "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [[["flatten_1", 0, 0, {}]]]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 5,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}},
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [[["dense_1", 0, 0, {}]]]
        }
      ]
    },
    "keras_version": "2.11.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel:0",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias:0",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel:0",
          "shape": [1605632, 128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias:0",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel:0",
          "shape": [128, 5],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias:0",
          "shape": [5],
          "dtype": "float32"
        }
      ]
    }
  ]
}
